ИС_СПОРТ_2022/src/Documents/ПротоколСоревнования/ПротоколСоревнования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколСоревнования</name>
  <basedOn>Document.Соревнование</basedOn>
  <registerRecords>InformationRegister.РезультатыПараметровСпортсменов</registerRecords>
  <registerRecords>InformationRegister.ДостиженияСпортсменовПоПротоколу</registerRecords>
  <registerRecords>InformationRegister.ИтоговыеРезультатыСоревнования</registerRecords>
  <registerRecords>AccumulationRegister.ПодсчетРейтингов</registerRecords>
  <registerRecords>InformationRegister.ЗачетныеКнижкиСпортсменов</registerRecords>
  <attributes>
    <name>УчебныйГод</name>
    <type>
      <types>CatalogRef.УчебныйГод</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Соревнование</types>
    </type>
  </attributes>
  <attributes>
    <name>Соревнование</name>
    <type>
      <types>CatalogRef.Соревнование</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагруженИзВнешнейСистемы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРезультата</name>
    <type>
      <types>EnumRef.ТипыРезультатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизаторСоревнования</name>
    <type>
      <types>CatalogRef.ОрганизаторыСоревнований</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодсчетаРезультата</name>
    <type>
      <types>EnumRef.ТипПодсчетаРезультата</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСоревнования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСоревнования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоПроведения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставУчастников</name>
    <attributes>
      <name>GUIDУчастника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>СтартовыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>Команда</name>
      <type>
        <types>CatalogRef.Команды</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтставаниеМилСек</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>27</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыСоревнования</name>
    <attributes>
      <name>Параметр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>GUIDУчастника</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатЧисло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>25</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатБулево</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>CatalogRef.СостоянияПопыток</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/InformationRegisters/ВключениеСоревнованийВРейтинги/ВключениеСоревнованийВРейтинги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВключениеСоревнованийВРейтинги</name>
  <dimensions>
    <name>Соревнование</name>
    <type>
      <types>CatalogRef.Соревнование</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейтинг</name>
    <type>
      <types>CatalogRef.Рейтинги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ИС_СПОРТ_2022/src/Catalogs/Рейтинги/Рейтинги.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Рейтинги</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаРейтинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияРейтинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецРейтинга</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРейтинга</name>
    <type>
      <types>EnumRef.Статусы</types>
    </type>
  </attributes>
  <attributes>
    <name>Организатор</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодсчетаРейтинга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГлавныйСудья</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаместительГлавногоСудьи</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Секретарь</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГлавнаяЦель</name>
    <type>
      <types>CatalogRef.ЦелиПроведенияРейтинга</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпонсорыРейтинга</name>
    <attributes>
      <name>Спонсор</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦелиРейтинга</name>
    <attributes>
      <name>Цель</name>
      <type>
        <types>CatalogRef.ЦелиПроведенияРейтинга</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МеждународныеВозрастныеГруппы</name>
    <attributes>
      <name>МеждународнаяВозрастнаяГруппа</name>
      <type>
        <types>CatalogRef.МеждународныеВозрастныеГруппы</types>
      </type>
    </attributes>
    <attributes>
      <name>СистемаПодсчетаБаллов</name>
      <type>
        <types>CatalogRef.СистемаПодсчетаБаллов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/СистемаПодсчетаБаллов/СистемаПодсчетаБаллов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СистемаПодсчетаБаллов</name>
  <owners>Catalog.Организации</owners>
  <tabularSections>
    <name>БалльнаяСистема</name>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоБаллов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Documents/ПротоколСоревнования/ManagerModule.bsl
// {Рарус adilas #18019 -Дисциплины 2021.07.07
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка"               		, ДокументСсылка);
	Запрос.УстановитьПараметр("Период"               		, ДокументСсылка.Дата);
	Запрос.УстановитьПараметр("ВидСпорта"            		, ДокументСсылка.ВидСпорта);
	Запрос.УстановитьПараметр("УчебныйГод"              	, ДокументСсылка.УчебныйГод);
	Запрос.УстановитьПараметр("Организация"          		, ДокументСсылка.Организация);
	Запрос.УстановитьПараметр("ОрганизаторСоревнования" 	, ДокументСсылка.ОрганизаторСоревнования);
	// {Рарус adilas #11621 -Интервал периода соревнований в протоколе 2020.12.14
	Запрос.УстановитьПараметр("ДатаНачалаСоревнования"   	, ДокументСсылка.ДатаНачалаСоревнования);
	Запрос.УстановитьПараметр("ДатаОкончанияСоревнования"   , ДокументСсылка.ДатаОкончанияСоревнования);
	// }Рарус adilas #11621 -Интервал периода соревнований в протоколе 2020.12.14
	Запрос.УстановитьПараметр("Соревнование"         		, ДокументСсылка.Соревнование);
	// {Рарус adilas #11824 -Место проведения соревнования 2021.01.29
	Запрос.УстановитьПараметр("МестоПроведения"         	, ДокументСсылка.МестоПроведения);
	// }Рарус adilas #11824 -Место проведения соревнования 2021.01.29
	Запрос.УстановитьПараметр("ДокументОснование"    		, ДокументСсылка.ДокументОснование);
	Запрос.УстановитьПараметр("ТипРезультата"    	 		, ДокументСсылка.ТипРезультата);
	Запрос.УстановитьПараметр("СпособПодсчетаРезультата"	, ДокументСсылка.СпособПодсчетаРезультата);
	Запрос.УстановитьПараметр("ПроводитьПараметры"   		, ?(ДокументСсылка.ДокументОснование.КоличествоПараметров>1,Истина,Ложь));
	Запрос.Текст =  "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	СоставУчастников.Ссылка КАК Ссылка,
	                |	СоставУчастников.Спортсмен КАК Спортсмен,
	                |	СоставУчастников.GUIDУчастника КАК GUIDУчастника,
	                |	СоставУчастников.СтартовыйНомер КАК СтартовыйНомер,
	                |	СоставУчастников.Место КАК Место,
	                |	СоставУчастников.РезультатЧисло КАК РезультатЧисло,
	                |	СоставУчастников.РезультатБулево КАК РезультатБулево,
	                |	СоставУчастников.ОтставаниеМилСек КАК ОтставаниеМилСек,
	                |	СоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	СоставУчастников.Команда КАК Команда,
	                |	СоставУчастников.Дисциплина КАК Дисциплина
	                |ПОМЕСТИТЬ ВТ_Спортсмены
	                |ИЗ
	                |	Документ.ПротоколСоревнования.СоставУчастников КАК СоставУчастников
	                |ГДЕ
	                |	СоставУчастников.Ссылка = &Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""РезультатыПараметровСпортсменов"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&Организация КАК Организация,
	                |	&Соревнование КАК Соревнование,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	ВТ_Спортсмены.Спортсмен КАК Спортсмен,
	                |	ВТ_Спортсмены.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	ВТ_Спортсмены.Команда КАК Команда,
	                |	ПротоколСоревнования.Параметр КАК Параметр,
	                |	ПротоколСоревнования.РезультатЧисло КАК РезультатЧисло,
	                |	ПротоколСоревнования.РезультатБулево КАК РезультатБулево,
	                |	ПротоколСоревнования.Состояние КАК Состояние,
	                |	ВТ_Спортсмены.Дисциплина КАК Дисциплина
	                |ИЗ
	                |	Документ.ПротоколСоревнования.ПараметрыСоревнования КАК ПротоколСоревнования
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Спортсмены КАК ВТ_Спортсмены
	                |		ПО ПротоколСоревнования.Ссылка = ВТ_Спортсмены.Ссылка
	                |			И ПротоколСоревнования.GUIDУчастника = ВТ_Спортсмены.GUIDУчастника
	                |			И ПротоколСоревнования.Дисциплина = ВТ_Спортсмены.Дисциплина
	                |ГДЕ
	                |	ПротоколСоревнования.Ссылка = &Ссылка
	                |	И &ПроводитьПараметры
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	""ИтоговыеРезультатыСоревнования"" КАК ИмяРегистра_,
	                |	&Период КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&Соревнование КАК Соревнование,
	                |	&ДокументОснование КАК ДокументОснование,
	                |	&ВидСпорта КАК ВидСпорта,
	                |	СоставУчастников.Спортсмен КАК Спортсмен,
	                |	СоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	СоставУчастников.Команда КАК Команда,
	                |	СоставУчастников.РезультатЧисло КАК РезультатЧисло,
	                |	СоставУчастников.РезультатБулево КАК РезультатБулево,
	                |	СоставУчастников.ОтставаниеМилСек КАК ОтставаниеМилСек,
	                |	СоставУчастников.Место КАК Место,
	                |	СоставУчастников.СтартовыйНомер КАК СтартовыйНомер,
	                |	&ТипРезультата КАК ТипРезультата,
	                |	&ОрганизаторСоревнования КАК ОрганизаторСоревнования,
	                |	&СпособПодсчетаРезультата КАК СпособПодсчетаРезультата,
	                |	&ДатаНачалаСоревнования КАК ДатаНачалаСоревнования,
	                |	&ДатаОкончанияСоревнования КАК ДатаОкончанияСоревнования,
	                |	&МестоПроведения КАК МестоПроведения,
	                |	СоставУчастников.Дисциплина КАК Дисциплина
	                |ИЗ
	                |	Документ.ПротоколСоревнования.СоставУчастников КАК СоставУчастников
	                |ГДЕ
	                |	СоставУчастников.Ссылка = &Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ВключениеСоревнованийВРейтинги.Рейтинг КАК Рейтинг,
	                |	ВключениеСоревнованийВРейтинги.Рейтинг.Организатор КАК Организатор,
	                |	РейтингиМеждународныеВозрастныеГруппы.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	РейтингиМеждународныеВозрастныеГруппы.СистемаПодсчетаБаллов КАК СистемаПодсчетаБаллов,
	                |	&ОрганизаторСоревнования КАК ОрганизаторСоревнования
	                |ПОМЕСТИТЬ ВТ_Рейтинги
	                |ИЗ
	                |	РегистрСведений.ВключениеСоревнованийВРейтинги КАК ВключениеСоревнованийВРейтинги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Рейтинги.МеждународныеВозрастныеГруппы КАК РейтингиМеждународныеВозрастныеГруппы
	                |		ПО ВключениеСоревнованийВРейтинги.Рейтинг = РейтингиМеждународныеВозрастныеГруппы.Ссылка
	                |ГДЕ
	                |	ВключениеСоревнованийВРейтинги.Соревнование = &Соревнование
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	ВТ_Рейтинги.Рейтинг КАК Рейтинг,
	                |	ВТ_Рейтинги.Организатор КАК Организатор,
	                |	ВТ_Рейтинги.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	БалльнаяСистема.Место КАК Место,
	                |	БалльнаяСистема.КоличествоБаллов КАК КоличествоБаллов,
	                |	ВТ_Рейтинги.ОрганизаторСоревнования КАК ОрганизаторСоревнования
	                |ПОМЕСТИТЬ ВТ_СистемаПодсчетаБаллов
	                |ИЗ
	                |	ВТ_Рейтинги КАК ВТ_Рейтинги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СистемаПодсчетаБаллов.БалльнаяСистема КАК БалльнаяСистема
	                |		ПО ВТ_Рейтинги.СистемаПодсчетаБаллов = БалльнаяСистема.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                |	""ПодсчетРейтингов"" КАК ИмяРегистра,
	                |	&Период КАК Период,
	                |	&УчебныйГод КАК УчебныйГод,
	                |	&Организация КАК Организация,
	                |	&Соревнование КАК Соревнование,
	                |	СоставУчастников.Спортсмен КАК Спортсмен,
	                |	СоставУчастников.МеждународнаяВозрастнаяГруппа КАК МеждународнаяВозрастнаяГруппа,
	                |	СоставУчастников.Место КАК Место,
	                |	СоставУчастников.Команда КАК Команда,
	                |	ВТ_СистемаПодсчетаБаллов.Рейтинг КАК Рейтинг,
	                |	ВТ_СистемаПодсчетаБаллов.Организатор КАК Организатор,
	                |	ВТ_СистемаПодсчетаБаллов.КоличествоБаллов КАК КоличествоБаллов,
	                |	ВТ_СистемаПодсчетаБаллов.ОрганизаторСоревнования КАК ОрганизаторСоревнования,
	                |	СоставУчастников.Дисциплина КАК Дисциплина
	                |ИЗ
	                |	Документ.ПротоколСоревнования.СоставУчастников КАК СоставУчастников
	                |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СистемаПодсчетаБаллов КАК ВТ_СистемаПодсчетаБаллов
	                |		ПО СоставУчастников.МеждународнаяВозрастнаяГруппа = ВТ_СистемаПодсчетаБаллов.МеждународнаяВозрастнаяГруппа
	                |			И СоставУчастников.Место = ВТ_СистемаПодсчетаБаллов.Место
	                |ГДЕ
	                |	СоставУчастников.Ссылка = &Ссылка
	                |	И СоставУчастников.Место <> 0
	                |	И ВТ_СистемаПодсчетаБаллов.КоличествоБаллов <> 0";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ТаблицаРезультатыПараметровСпортсменов = Пакет[1].Выгрузить();
	ТаблицаИтоговыеРезультатыСоревнования  = Пакет[2].Выгрузить();
	ТаблицаПодсчетРейтингов                = Пакет[5].Выгрузить();
	
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаИтоговыеРезультатыСоревнования"  , ТаблицаИтоговыеРезультатыСоревнования);
	ТаблицыДляДвижений.Вставить("ТаблицаРезультатыПараметровСпортсменов" , ТаблицаРезультатыПараметровСпортсменов);
	ТаблицыДляДвижений.Вставить("ТаблицаПодсчетРейтингов"                , ТаблицаПодсчетРейтингов);
	
    ДополнительныеСвойства.Вставить("Отказ", Отказ);
	
КонецПроцедуры	

Процедура ВыполнитьКонтрольРезультатовПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколСоревнования.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольПередПроведением(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколСоревнования.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьКонтрольРезультатовОтменыПроведения(Объект, Отказ) Экспорт
	
	Если Ложь Тогда
		Объект = Документы.ПротоколСоревнования.СоздатьДокумент();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
// }Рарус adilas #18019 -Дисциплины 2021.07.07
